Revit 2027 API
BuiltInFailures.DesignOptionFailures.BadReferenceToSecondary Property
 No element in a secondary Option can be referenced by an element outside that Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadReferenceToSecondary { get; }
Public Shared ReadOnly Property BadReferenceToSecondary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadReferenceToSecondary {
	FailureDefinitionId^ get ();
}
static member BadReferenceToSecondary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace